insert into stadium
(
    name,
    size,
    address,
    region,
    minimum_personnel,
    maximum_personnel,
    parking_available,
    shower_available,
    description,
    start_time,
    end_time,
    active,
    created_at,
    created_by,
    updated_at,
    updated_by
)
values
    ('플랩스타디움 별내 1구장', 30, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('플랩스타디움 별내 2구장', 32, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 불가능', '2023-05-13 15:00:00', '2023-05-13 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('강동송파풋살장', 30, '서울시 강동구 풍납동', 'SEOUL' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('송파천마풋살', 30, '서울시 송파구 마천동', 'SEOUL' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('플랩스타디움 별내 3구장', 30, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('플랩스타디움 별내 4구장', 30, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('플랩스타디움 별내 5구장', 30, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('플랩스타디움 별내 6구장', 30, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('플랩스타디움 별내 7구장', 30, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재'),
    ('플랩스타디움 별내 8구장', 30, '경기도 남양주시 별내동', 'KYEONGGI' , 10, 18, false, true, '주차 가능', '2023-05-12 15:00:00', '2023-05-12 17:00:00', false, now(),'이승재',now(),'이승재');

insert into member
(member_name, nickname, gender, cash, birth, level, manner, coupon, point)
values
    ('이승재','lsj','남',10000,'1993-12-12','SEMIPRO','중','신규 가입 쿠폰','200'),
    ('진민기','jmk','남',20000,'1993-12-12','PRO','최상','신규 가입 쿠폰','200'),
    ('김영상','kys','남',30000,'1993-12-12','ROOKIE','최하','신규 가입 쿠폰','200'),
    ('박준영','pjy','남',10000,'1993-12-12','ROOKIE','하','신규 가입 쿠폰','200'),
    ('권우재','kwj','남',20000,'1993-12-12','SEMIPRO','중','신규 가입 쿠폰','200'),
    ('오장현','ojh','남',30000,'1993-12-12','SEMIPRO','최하','신규 가입 쿠폰','200'),
    ('박현수','phs','남',10000,'1993-12-12','PRO','하','신규 가입 쿠폰','200'),
    ('변병우','bbw','남',20000,'1993-12-12','SEMIPRO','상','신규 가입 쿠폰','200'),
    ('조언수','jus','남',30000,'1993-12-12','PRO','상','신규 가입 쿠폰','200'),
    ('문지웅','mjw','남',10000,'1993-12-12','ROOKIE','중','신규 가입 쿠폰','200');

insert into manager
(manager_name, phonenumber, gender,account)
values
    ('홍길동','01022221115','남','국민은행');

insert into reservable_stadium
(stadium_name, rental_price, rule, start_time, end_time, available_gender,created_at,
 created_by,
 updated_at,
 updated_by)
values
    ('플랩 스타디움 별내 1구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 2구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 3구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 4구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 5구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 6구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 7구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 8구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 9구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재'),
    ('플랩 스타디움 별내 10구장', 10000, '사람을 향한 거친 태클 금지', '2023-05-12 15:00:00', '2023-05-12 17:00:00', '여',now(),'이승재',now(),'이승재');

